; domain
(define
    (domain wieze)
    (:requirements :adl :equality)
    (:predicates
        (palik ?x)
        (mniejszy ?x ?y)
        (napaliku ?x ?y)
    )
    (:action przesun-na-pusty
        :parameters (?x ?y ?z)
        :precondition
        (and
            (palik ?x)
            (palik ?y)
            (napaliku ?x ?z)
            (not (= ?x ?y))
            (not (exists (?p) (and(mniejszy ?p ?z)(napaliku ?x ?p))))
            (not (exists (?p) (napaliku ?y ?p)))
        )
        :effect
        (and
            (not (napaliku ?x ?z))
            (napaliku ?y ?z)
        )
    )
    (:action przesun
        :parameters (?x ?y ?z)
        :precondition
        (and
            (palik ?x)
            (palik ?y)
            (napaliku ?x ?z)
            (not (= ?x ?y))
            (not (exists (?p) (and(mniejszy ?p ?z)(napaliku ?x ?p))))
            (not (exists (?p) (and(mniejszy ?p ?z)(napaliku ?y ?p))))
        )
        :effect
        (and
            (not (napaliku ?x ?z))
            (napaliku ?y ?z)
        )
    )
)

; problem
(define (problem gsoko1a)
(:domain wieze)
(:objects x y z k1 k2 k3 k4 k5 )
(:init
(palik x)
(palik y)
(palik z)
(mniejszy k1 k2)
(mniejszy k1 k3)
(mniejszy k1 k4)
(mniejszy k1 k5)
(mniejszy k2 k3)
(mniejszy k2 k4)
(mniejszy k2 k5)
(mniejszy k3 k4)
(mniejszy k3 k5)
(mniejszy k4 k5)
(napaliku x k1)
(napaliku x k2)
(napaliku x k3)
(napaliku x k4)
(napaliku x k5)
)
(:goal (and
( napaliku z k1  )
( napaliku z k2  )
( napaliku z k3  )
( napaliku z k4  )
( napaliku z k5  )
))
)

; plan
1. (przesun-na-pusty x z k1)
   deleted: (napaliku x k1)
   added: (napaliku z k1)
   goals met: 1 of 5
2. (przesun x y k2)
   deleted: (napaliku x k2)
   added: (napaliku y k2)
   goals met: 1 of 5
3. (przesun z y k1)
   deleted: (napaliku z k1)
   added: (napaliku y k1)
   goals met: 0 of 5
4. (przesun-na-pusty x z k3)
   deleted: (napaliku x k3)
   added: (napaliku z k3)
   goals met: 1 of 5
5. (przesun y x k1)
   deleted: (napaliku y k1)
   added: (napaliku x k1)
   goals met: 1 of 5
6. (przesun y z k2)
   deleted: (napaliku y k2)
   added: (napaliku z k2)
   goals met: 2 of 5
7. (przesun x z k1)
   deleted: (napaliku x k1)
   added: (napaliku z k1)
   goals met: 3 of 5
8. (przesun x y k4)
   deleted: (napaliku x k4)
   added: (napaliku y k4)
   goals met: 3 of 5
9. (przesun z y k1)
   deleted: (napaliku z k1)
   added: (napaliku y k1)
   goals met: 2 of 5
10. (przesun z x k2)
   deleted: (napaliku z k2)
   added: (napaliku x k2)
   goals met: 1 of 5
11. (przesun y x k1)
   deleted: (napaliku y k1)
   added: (napaliku x k1)
   goals met: 1 of 5
12. (przesun z y k3)
   deleted: (napaliku z k3)
   added: (napaliku y k3)
   goals met: 0 of 5
13. (przesun-na-pusty x z k1)
   deleted: (napaliku x k1)
   added: (napaliku z k1)
   goals met: 1 of 5
14. (przesun x y k2)
   deleted: (napaliku x k2)
   added: (napaliku y k2)
   goals met: 1 of 5
15. (przesun z y k1)
   deleted: (napaliku z k1)
   added: (napaliku y k1)
   goals met: 0 of 5
16. (przesun-na-pusty x z k5)
   deleted: (napaliku x k5)
   added: (napaliku z k5)
   goals met: 1 of 5
17. (przesun-na-pusty y x k1)
   deleted: (napaliku y k1)
   added: (napaliku x k1)
   goals met: 1 of 5
18. (przesun y z k2)
   deleted: (napaliku y k2)
   added: (napaliku z k2)
   goals met: 2 of 5
19. (przesun x z k1)
   deleted: (napaliku x k1)
   added: (napaliku z k1)
   goals met: 3 of 5
20. (przesun-na-pusty y x k3)
   deleted: (napaliku y k3)
   added: (napaliku x k3)
   goals met: 3 of 5
21. (przesun z x k1)
   deleted: (napaliku z k1)
   added: (napaliku x k1)
   goals met: 2 of 5
22. (przesun z y k2)
   deleted: (napaliku z k2)
   added: (napaliku y k2)
   goals met: 1 of 5
23. (przesun x z k1)
   deleted: (napaliku x k1)
   added: (napaliku z k1)
   goals met: 2 of 5
24. (przesun y x k2)
   deleted: (napaliku y k2)
   added: (napaliku x k2)
   goals met: 2 of 5
25. (przesun z x k1)
   deleted: (napaliku z k1)
   added: (napaliku x k1)
   goals met: 1 of 5
26. (przesun y z k4)
   deleted: (napaliku y k4)
   added: (napaliku z k4)
   goals met: 2 of 5
27. (przesun x z k1)
   deleted: (napaliku x k1)
   added: (napaliku z k1)
   goals met: 3 of 5
28. (przesun x y k2)
   deleted: (napaliku x k2)
   added: (napaliku y k2)
   goals met: 3 of 5
29. (przesun z y k1)
   deleted: (napaliku z k1)
   added: (napaliku y k1)
   goals met: 2 of 5
30. (przesun x z k3)
   deleted: (napaliku x k3)
   added: (napaliku z k3)
   goals met: 3 of 5
31. (przesun-na-pusty y x k1)
   deleted: (napaliku y k1)
   added: (napaliku x k1)
   goals met: 3 of 5
32. (przesun y z k2)
   deleted: (napaliku y k2)
   added: (napaliku z k2)
   goals met: 4 of 5
33. (przesun x z k1)
   deleted: (napaliku x k1)
   added: (napaliku z k1)
   goals met: 5 of 5
